advanced/frontend/controllers/User2Controller.php

INSERT INTO `user2` (`name`, `age`) VALUES ('fff', 123)
---
    public function actionAdd(){
        $request = Yii::$app->request;
        if($request->isPost){
            $data = $request->post();
            //print_r($data);
            unset($data['_csrf']);
            //print_r($data);die;
            $res = Yii::$app->db->createCommand()->insert('user2',$data)->execute();

SELECT * FROM `user2`
SELECT * FROM `user2` LIMIT 5
---
    public function actionShow()
    {
        $query=new Query();
        $re=$query->from('user2')->all();
        $count=count($re);
        $pages = new Pagination(['totalCount' =>$count]);
        $pages->setPageSize(5);
        $models=$query
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->all();

DELETE FROM `user2` WHERE `id`='4'
---
    public function actionDel(){
        $id = Yii::$app->request->get("id");
        // var_dump($id);die;
        $res = Yii::$app->db->createCommand()->delete('user2',array("id"=>$id))->execute();